vetis_api/templates/vetis_api/xml/GetStockEntryChangesList.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:apldef="http://api.vetrf.ru/schema/cdm/application/ws-definitions"
xmlns:appl="http://api.vetrf.ru/schema/cdm/application"
xmlns:merc="http://api.vetrf.ru/schema/cdm/mercury/g2b/applications/v2"
xmlns:bs="http://api.vetrf.ru/schema/cdm/base"
xmlns:vd="http://api.vetrf.ru/schema/cdm/mercury/vet-document/v2"
xmlns:dt="http://api.vetrf.ru/schema/cdm/dictionary/v2">
   <soapenv:Header/>
   <soapenv:Body>
      <apldef:submitApplicationRequest>
         <apldef:apiKey>{{ vetis_request.api_key }}</apldef:apiKey>
         <appl:application>
            <appl:serviceId>{{ vetis_request.service_id }}</appl:serviceId>
            <appl:issuerId>{{ vetis_request.issuer_id }}</appl:issuerId>
            <appl:issueDate>{{ vetis_request.issue_date }}</appl:issueDate>
            <appl:data>
               <merc:getStockEntryChangesListRequest>
         			<merc:localTransactionId>{{ vetis_request.local_transaction_id }}</merc:localTransactionId>
         			<merc:initiator>
         				<vd:login>{{ vetis_request.initiator_login }}</vd:login>
				      </merc:initiator>
				      <bs:listOptions>
            			<bs:count>{{ vetis_request.list_count }}</bs:count>
            			<bs:offset>{{ vetis_request.list_offset }}</bs:offset>
         			</bs:listOptions>
                  <bs:updateDateInterval>
             			<bs:beginDate>{{ vetis_request.begin_date }}</bs:beginDate>
              			<bs:endDate>{{ vetis_request.end_date }}</bs:endDate>
                  </bs:updateDateInterval>
         			<dt:enterpriseGuid>{{ vetis_request.enterprise_guid }}</dt:enterpriseGuid>
         		</merc:getStockEntryChangesListRequest>
            </appl:data>
         </appl:application>
      </apldef:submitApplicationRequest>
   </soapenv:Body>
</soapenv:Envelope>